# SetYoungModulus Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..SetYoungModulus Method
StructuralAsset Class See Also
---
Sets the Young's modulus of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetYoungModulus(
	double youngModulus
)
```

Visual Basic
---
```text
Public Sub SetYoungModulus ( _
	youngModulus As Double _
)
```

Visual C++
---
```text
public:
void SetYoungModulus(
	double youngModulus
)
```

# ### Parameters
youngModulus
    Type: System..::..Double
# Remarks
The Young's modulus is one-dimensional for wood-based and isotropic materials. This method sets the x, y, and z components to the same value. The value is in Newtons per foot meter (N/(ft · m)).
# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace